[
    {
        "question_text": "Voltmeter range may be altered for a moving-iron voltmeter by connecting a resistance in series with the coil.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "For moving-iron voltmeters, the measurement range can be extended by connecting a high resistance, known as a multiplier, in series with the instrument's coil. This series resistance limits the current flowing through the coil for a given voltage, allowing the instrument to measure higher potential differences without exceeding the coil's current rating.",
        "has_latex": false,
        "difficulty_score": 1.0
    },
    {
        "question_text": "The damping force brings the moving system to rest at the deflected position reasonably quickly without any oscillation or negligible oscillation.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "The primary function of a damping force in a measuring instrument is to counteract the natural tendency of the pointer and moving system to oscillate around the final reading due to inertia. This force ensures that the pointer settles at its correct position quickly and smoothly, providing a stable and readable measurement.",
        "has_latex": false,
        "difficulty_score": 1.2
    },
    {
        "question_text": "When current is passed through the coil windings, torque is developed on the coil by the interaction of the magnetic field and the field set up by the voltage in the coil.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 1,
        "explanation": "The deflecting torque in a moving coil instrument is a result of the motor principle. It is generated by the interaction between the magnetic field from the permanent magnet and the magnetic field produced by the current flowing through the coil windings, not the voltage.",
        "has_latex": false,
        "difficulty_score": 1.5
    },
    {
        "question_text": "The ammeter has a resistance but it is very small and will not affect any reading taken.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 1,
        "explanation": "While an ideal ammeter would have zero resistance, a practical ammeter has a very small internal resistance. However, inserting this resistance into a circuit can slightly alter the total resistance of the circuit, and thus change the current it is intended to measure. This is known as an \"insertion error.\" Although the effect is minimized by making the ammeter resistance as low as possible, it can still affect the reading, particularly in low-resistance circuits.",
        "has_latex": false,
        "difficulty_score": 1.5
    },
    {
        "question_text": "Analogue and digital oscilloscopes have the same principle and basic characteristics.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "Both analog and digital oscilloscopes operate on the same fundamental principle of visually displaying an electrical signal's voltage over time. They share basic characteristics such as vertical and horizontal amplifiers, a trigger system, and a display. The primary difference lies in how they process and display the signal—analog scopes directly trace the waveform, while digital scopes sample the waveform and reconstruct it digitally.",
        "has_latex": false,
        "difficulty_score": 1.2
    },
    {
        "question_text": "The cathode ray oscilloscope is probably the most versatile electrical measuring instrument available.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "The Cathode Ray Oscilloscope (CRO) is an extremely versatile instrument because it can measure a wide variety of electrical parameters, including AC/DC voltage and current, time periods, frequency, and the phase relationship between different signals, all presented in a visual format.",
        "has_latex": false,
        "difficulty_score": 1.0
    },
    {
        "question_text": "The cathode ray oscilloscope can measure phase relationship and frequency.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "An oscilloscope is capable of measuring both frequency and phase relationships. Frequency is determined by measuring the period (time for one cycle) of a repetitive waveform from the horizontal axis. Phase relationships between two signals can be determined by observing the time delay between them on the screen or by using Lissajous patterns.",
        "has_latex": false,
        "difficulty_score": 1.0
    },
    {
        "question_text": "The horizontal scale of the oscilloscope can be used to measure displacement.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 1,
        "explanation": "The horizontal scale (X-axis) of an oscilloscope is calibrated to measure time. It is used to determine the period, pulse width, and time delay of a signal. The vertical scale (Y-axis) is used to measure voltage or amplitude. Displacement is not a standard measurement for the horizontal axis.",
        "has_latex": false,
        "difficulty_score": 1.5
    },
    {
        "question_text": "The measurement of a repetitive waveform period of an oscilloscope can be used to calculate the signal frequency.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "The frequency of a signal is the reciprocal of its period (f = 1/T). An oscilloscope directly measures the period (T) of a repetitive waveform using its calibrated time base (horizontal axis). Once the period is measured, the frequency can be easily calculated.",
        "has_latex": false,
        "difficulty_score": 1.2
    },
    {
        "question_text": "When two wires with similar electrical properties are joined at both ends and one junction is made hot and the other cold, a small electric current is produced proportional to the difference in the temperature.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 1,
        "explanation": "This phenomenon, known as the Seebeck effect, occurs when two wires of dissimilar electrical properties are joined. If the wires were similar, no net electromotive force (and thus no current) would be generated, as the thermoelectric effects in both wires would be identical and cancel each other out.",
        "has_latex": false,
        "difficulty_score": 1.5
    },
    {
        "question_text": "The Peltier effect shows that heat is absorbed at the cold end and rejected at the hot end.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 1,
        "explanation": "Peltier showed that heat is absorbed at the hot junction and rejected at the cold junction of a thermocouple. This effect is related to the flow of current through the junctions of dissimilar materials.",
        "has_latex": false,
        "difficulty_score": 1.0
    },
    {
        "question_text": "The direct type of the thermocouple has the advantage of good sensitivity and slow activity.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 1,
        "explanation": "The direct-type thermocouple is noted for its good sensitivity and quick activity (fast response time), not slow activity. Its direct exposure to the heat source allows for rapid temperature detection.",
        "has_latex": false,
        "difficulty_score": 1.0
    },
    {
        "question_text": "The indirect type of the thermocouple is less sensitive and more sluggish in operation, but has applications for high currents.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "In an indirect-type thermocouple, the heater circuit is isolated from the measurement meter. This design makes it less sensitive and slower to respond compared to the direct type. However, this isolation allows it to be used for measuring high currents, as the current passes through a separate heater wire, which then heats the thermocouple junction.",
        "has_latex": false,
        "difficulty_score": 1.2
    },
    {
        "question_text": "Clamp meters are a very convenient testing instrument that permits voltage measurements on a live conductor without circuit interruption.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 1,
        "explanation": "Clamp meters are designed to permit current measurements on a live conductor without interrupting the circuit. They operate by measuring the strength of the magnetic field around the conductor. While many modern clamp meters also include probes for measuring voltage, their unique 'clamp' feature is specifically for measuring current.",
        "has_latex": false,
        "difficulty_score": 1.5
    },
    {
        "question_text": "A moving coil instrument consists basically of a permanent magnet to provide a magnetic field and a small lightweight coil wound on a rectangular soft iron core that is stationary around its vertical axis.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 1,
        "explanation": "In a Permanent Magnet Moving Coil (PMMC) instrument, the small lightweight coil is not stationary; it is free to rotate around its vertical axis. The deflecting torque causes this rotation, which in turn moves the pointer across the scale. The permanent magnet and soft iron core are the stationary parts.",
        "has_latex": false,
        "difficulty_score": 1.5
    },
    {
        "question_text": "The value of control torque depends on the mechanical design of the control device.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "The controlling torque, which opposes the deflecting torque and brings the pointer to rest, is provided by a mechanical system, typically spiral springs or a gravity-based weight system. Therefore, its magnitude and characteristics are entirely dependent on the mechanical design and properties (e.g., spring constant, weight) of this control device.",
        "has_latex": false,
        "difficulty_score": 1.0
    },
    {
        "question_text": "A multirange ammeter can be constructed simply by employing several values of shunt resistances, with a rotary switch to select the desired range.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "To create a multirange ammeter from a basic meter movement, several shunt resistors are connected in parallel with the movement. A rotary switch is used to select which shunt resistor is active, thereby diverting a specific proportion of the total current away from the meter coil and allowing different current ranges to be measured.",
        "has_latex": false,
        "difficulty_score": 1.2
    },
    {
        "question_text": "In a multirange ammeter, a make-before-break switch must be used so that the instrument is not left without a shunt in parallel in order to prevent a large current flow through the ammeter.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "A make-before-break switch is crucial for multirange ammeters. When changing ranges, this type of switch connects to the next shunt resistor before disconnecting from the current one. This ensures the meter's delicate coil is never left unshunted and directly in the path of the full circuit current, which could damage or destroy it.",
        "has_latex": false,
        "difficulty_score": 1.5
    },
    {
        "question_text": "When an instrument is used as in the multirange ammeter, care must be taken to ensure that the shunt does not become short-circuited, even for a very short instant.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 1,
        "explanation": "The primary concern when switching ranges in a multirange ammeter is ensuring the meter movement does not become open-circuited from its shunt, which would force the full current through the delicate coil. A short-circuited shunt would mean all current bypasses the meter, which would simply result in a zero reading, not damage. The danger lies in having no shunt at all.",
        "has_latex": false,
        "difficulty_score": 1.8
    },
    {
        "question_text": "To minimize voltmeter loading in multi-range voltmeters, the voltmeter operating current should be very high.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 1,
        "explanation": "To minimize the loading effect (the alteration of the circuit's behavior by the voltmeter), a voltmeter should draw as little current as possible from the circuit it is measuring. A high operating current would mean the voltmeter has a low resistance, which would significantly alter the voltage it is intended to measure. Therefore, the operating current should be very low.",
        "has_latex": false,
        "difficulty_score": 1.5
    },
    {
        "question_text": "To minimize voltmeter loading in multi-range voltmeters, the resistance connected in series with the coil should be high.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "A voltmeter is connected in parallel with a component to measure the voltage across it. To minimize its loading effect, the voltmeter must have a very high total resistance so it draws minimal current from the circuit. This is achieved by connecting a high-value multiplier resistor in series with the meter's coil.",
        "has_latex": false,
        "difficulty_score": 1.2
    },
    {
        "question_text": "The moving coil instruments can be suitably modified to act either as an ammeter or as a voltmeter.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "A basic Permanent Magnet Moving Coil (PMMC) instrument is a sensitive current-measuring device. It can be modified to function as an ammeter by connecting a low-resistance shunt in parallel, or as a voltmeter by connecting a high-resistance multiplier in series.",
        "has_latex": false,
        "difficulty_score": 1.2
    },
    {
        "question_text": "For multi-range voltmeters (MRV), the rotary switch used with the voltmeter should be a break-before make type.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "Unlike in a multirange ammeter, the rotary switch in a multirange voltmeter should be a break-before-make type. This is because the multiplier resistors are in series. Momentarily having two multiplier resistors in parallel during a 'make-before-break' transition would briefly lower the voltmeter's total resistance, which is not harmful. A simple break-before-make switch is sufficient and standard.",
        "has_latex": false,
        "difficulty_score": 1.8
    },
    {
        "question_text": "A break-before make type of rotary switch is used in the MRV so that the moving contact will connect to one terminal before connecting to the next terminal.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 1,
        "explanation": "The description 'connect to one terminal before connecting to the next terminal' accurately describes a make-before-break switch. A break-before-make switch, which is used in a multirange voltmeter, works by having the moving contact disconnect from one terminal before it connects to the next.",
        "has_latex": false,
        "difficulty_score": 1.5
    },
    {
        "question_text": "The MRV has a uniformly divided scale.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "In a Permanent Magnet Moving Coil (PMMC) instrument, the deflecting torque is directly proportional to the current. Since the controlling torque from the springs is directly proportional to the angle of deflection, the resulting deflection is directly proportional to the current (or voltage). This linear relationship results in a uniformly divided (linear) scale.",
        "has_latex": false,
        "difficulty_score": 1.2
    },
    {
        "question_text": "The MRV has low power consumption.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "Instruments based on the PMMC movement are very sensitive and operate on very small currents. Because power consumption is a function of voltage and current (P=VI), this low operating current results in very low power being drawn from the circuit under test, which is a significant advantage.",
        "has_latex": false,
        "difficulty_score": 1.0
    },
    {
        "question_text": "The MRV has no error due to stray magnetic fields.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 1,
        "explanation": "The statement should be that the error due to stray magnetic fields is very small, not completely absent. PMMC instruments have a strong internal permanent magnet, which makes their operation largely independent of weak external magnetic fields. However, very strong stray fields can still cause minor errors.",
        "has_latex": false,
        "difficulty_score": 1.2
    },
    {
        "question_text": "The MRV is suitable for both direct and alternating current.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 1,
        "explanation": "PMMC instruments work on the DC motor principle, where the direction of torque is dependent on the direction of current. On AC, the torque would reverse direction for each half-cycle. Due to the inertia of the moving system, the pointer cannot follow these rapid reversals and will simply vibrate around the zero position. Therefore, these instruments are suitable for DC measurements only.",
        "has_latex": false,
        "difficulty_score": 1.5
    },
    {
        "question_text": "Proper pivoting and balancing weight may reduce frictional errors associated with MRVs.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "Frictional error arises from the contact between the moving parts (spindle) and their supports (pivots or jewels). Ensuring the moving system is properly balanced with counterweights and that the pivots are finely constructed and well-maintained minimizes this friction, thereby increasing the accuracy of the instrument.",
        "has_latex": false,
        "difficulty_score": 1.2
    },
    {
        "question_text": "Ammeter sensitivity is determined by the amount of current required by the meter coil to produce full-scale deflection of the pointer.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "Ammeter sensitivity directly relates to the current needed for a full-scale deflection (FSD). A more sensitive ammeter requires a smaller current to move its pointer to the maximum position on the scale. For example, a meter with a 100 microampere FSD is more sensitive than one with a 1 milliampere FSD.",
        "has_latex": false,
        "difficulty_score": 1.2
    },
    {
        "question_text": "A moving-iron instrument (MII) has moving element as a small piece of soft iron in the form of a vane or rod.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "The core principle of a moving-iron instrument is that a movable piece of soft iron (a vane or rod) is acted upon by the magnetic field produced by a current-carrying coil. The force or repulsion on this iron vane causes it to move, thus deflecting the pointer.",
        "has_latex": false,
        "difficulty_score": 1.0
    },
    {
        "question_text": "In MII, the multiplier may be easily shunted by an inductor in order to compensate for frequency error.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 1,
        "explanation": "Frequency error in a moving-iron voltmeter arises because the instrument's impedance (which includes the coil's inductance) changes with frequency. To compensate for this, the multiplier resistor is typically shunted by a capacitor, not an inductor. This capacitor helps to make the total impedance of the voltmeter circuit less dependent on frequency.",
        "has_latex": false,
        "difficulty_score": 1.8
    },
    {
        "question_text": "MIIs are robust, owing to the simple construction of the moving parts.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "Moving-iron instruments have a simple and strong construction. The moving part is just a small piece of iron, and the coil is stationary. This contrasts with the delicate, finely wound coil and suspension system of a PMMC instrument, making MIIs generally more robust and able to withstand more mechanical stress.",
        "has_latex": false,
        "difficulty_score": 1.0
    },
    {
        "question_text": "In MIIs, error due to variation of frequency causes change of reactance of the coil and also changes the eddy currents induced in neighbouring metal.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "When a moving-iron instrument is used on AC, its accuracy can be affected by frequency. This is because the impedance of the operating coil (Z = \\sqrt{R^2 + (\\omega L)^2}) changes with frequency due to its inductive reactance (X_L = \\omega L). Additionally, changing frequencies alter the magnitude of eddy currents induced in nearby metal parts, which can also affect the magnetic field and thus the deflection.",
        "has_latex": true,
        "difficulty_score": 1.44
    },
    {
        "question_text": "MIIs have errors due to temperature variation.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "Temperature variations can cause errors in moving-iron instruments. A change in temperature can alter the resistance of the copper coil, which affects the current flowing through it. It can also slightly change the stiffness of the control springs, affecting the controlling torque.",
        "has_latex": false,
        "difficulty_score": 1.2
    },
    {
        "question_text": "The Wheatstone bridge is suitable for moderate resistance values.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "The Wheatstone bridge provides the most accurate results when measuring resistances in the moderate range, typically from 1 \\Omega to 10 M\\Omega. For very low resistances, contact and lead resistance introduce significant errors, and for very high resistances, leakage currents can affect accuracy.",
        "has_latex": true,
        "difficulty_score": 1.2
    },
    {
        "question_text": "The sensitivity of a galvanometer is governed by the voltage and internal resistance.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 1,
        "explanation": "The sensitivity of a galvanometer is defined by its current sensitivity (deflection per unit current) and its internal resistance. While voltage is required to drive the current, the defining characteristic of the galvanometer itself is how much it deflects for a given amount of current.",
        "has_latex": false,
        "difficulty_score": 1.2
    },
    {
        "question_text": "The Induction Wattmeter measures dc power only.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 1,
        "explanation": "The operating principle of an induction wattmeter relies on a rotating magnetic field produced by AC currents in its coils, which induces eddy currents in a metal disc. This principle does not work with DC. Therefore, induction-type instruments are suitable for AC measurements only.",
        "has_latex": false,
        "difficulty_score": 1.5
    },
    {
        "question_text": "The Dynamometer Wattmeter is used as a standard for calibrated purposes due to their high degree of accuracy.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "Dynamometer-type instruments can be constructed with a very high degree of precision. Because they are equally accurate on both AC and DC, they can be calibrated using a DC standard and then used as a transfer standard to measure AC power or calibrate other AC instruments.",
        "has_latex": false,
        "difficulty_score": 1.2
    },
    {
        "question_text": "Induction Wattmeter has high power consumption.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "Induction wattmeters require relatively large operating currents to produce the strong magnetic fields needed to induce eddy currents and create torque. This results in higher power consumption compared to other instrument types like dynamometer or PMMC instruments.",
        "has_latex": false,
        "difficulty_score": 1.2
    },
    {
        "question_text": "Induction Wattmeters are free from the effects of stray fields.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "A key advantage of induction-type instruments is that their strong internal operating magnetic fields make them relatively insensitive to the influence of external stray magnetic fields. This contributes to their reliability, especially in industrial environments.",
        "has_latex": false,
        "difficulty_score": 1.0
    },
    {
        "question_text": "The product of ammeter and voltmeter readings gives the actual power.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 1,
        "explanation": "In an AC circuit, the product of the voltmeter reading (V) and the ammeter reading (I) gives the apparent power (S = VI), measured in volt-amperes. The actual power (P), measured in watts, is given by P = VIcos\\Phi, where cos\\Phi is the power factor of the load. Only in a purely resistive DC circuit does the product of V and I equal the actual power.",
        "has_latex": true,
        "difficulty_score": 1.5
    },
    {
        "question_text": "Power in a three phase circuit using the one Wattmeter Method can only be used if the load is not balanced.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 1,
        "explanation": "The single-wattmeter method for measuring three-phase power is only valid if the load is perfectly balanced. Under this condition, the total power is simply three times the power measured in one phase. This method cannot be used for unbalanced loads.",
        "has_latex": false,
        "difficulty_score": 1.5
    },
    {
        "question_text": "Induction Wattmeters have a uniform scale.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "Induction wattmeters are designed to have a long and uniform (linear) scale, often spanning up to 300 degrees. This makes them easy to read and suitable for use as panel instruments in applications like switchboards.",
        "has_latex": false,
        "difficulty_score": 1.0
    },
    {
        "question_text": "The sensing element produces a signal that is related to the quantity being measured.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "The sensing element, also known as a transducer, is the first component of a measurement system. Its function is to detect the physical quantity being measured (e.g., temperature, pressure, current) and convert it into a more usable form, typically an electrical signal.",
        "has_latex": false,
        "difficulty_score": 1.0
    },
    {
        "question_text": "An Intelligent Measuring System is an analogue measuring system.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 1,
        "explanation": "An intelligent measuring system is inherently digital, as it employs a microprocessor or computer to process the measured data. These systems can perform calculations, make decisions, and interpret the data, which goes beyond the capabilities of a simple analog or 'dumb' measuring system that only provides a reading.",
        "has_latex": false,
        "difficulty_score": 1.2
    },
    {
        "question_text": "The environment where a measure is taken cannot affect the results of the measure.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 1,
        "explanation": "Environmental factors such as temperature, humidity, and electromagnetic interference can significantly affect the performance of a measuring instrument and introduce errors into the measurement. These are known as environmental errors, and care must be taken to shield instruments or operate them within specified environmental conditions to ensure accuracy.",
        "has_latex": false,
        "difficulty_score": 1.2
    },
    {
        "question_text": "Resolution is the limits between which readings can be made on an instrument.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 1,
        "explanation": "The limits between which readings can be made on an instrument define its range. Resolution refers to the smallest measurable interval or the smallest change in the input quantity that the instrument can detect and display.",
        "has_latex": false,
        "difficulty_score": 1.5
    },
    {
        "question_text": "Damping torque is provided by the induced currents in a metal former or core on which the coil is wound or in the circuit of the coil itself.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "This describes electromagnetic damping, a common method used in PMMC instruments. As the coil moves through the magnetic field, eddy currents are induced in the metal former (frame) on which the coil is wound. According to Lenz's law, these currents create a magnetic field that opposes the motion, thus producing a damping torque.",
        "has_latex": false,
        "difficulty_score": 1.2
    },
    {
        "question_text": "Multi-range voltmeters can have their power consumption made very low.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "Multirange voltmeters based on the PMMC movement are highly sensitive, meaning they require very little current for full-scale deflection. Since power consumption is low when the operating current is low, these instruments draw minimal power from the circuit under measurement.",
        "has_latex": false,
        "difficulty_score": 1.0
    },
    {
        "question_text": "For spiral springs and strip suspensions, the controlling torque is directly proportional to the angle of deflection of the coil.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "The controlling torque provided by spiral springs is based on the principle of elasticity. The torque exerted by the spring is directly proportional to the amount it is wound or unwound, which corresponds to the angle of deflection (\\theta) of the instrument's moving system. This relationship can be expressed as T_c = C\\theta, where C is the spring constant.",
        "has_latex": true,
        "difficulty_score": 1.2
    },
    {
        "question_text": "At final deflected position, the controlling torque becomes equal and opposite to the damping torque.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 1,
        "explanation": "When the pointer is at its final, stationary position, the moving system is in equilibrium. This occurs when the controlling torque is equal and opposite to the deflecting torque. The damping torque is proportional to the velocity of the moving system, so it becomes zero when the system comes to rest.",
        "has_latex": false,
        "difficulty_score": 1.8
    },
    {
        "question_text": "In the moving coil instrument, the deflecting angle is directly proportional to the current in the movable coil.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "In a PMMC instrument, the deflecting torque is directly proportional to the current (T_d \\propto I). The controlling torque is directly proportional to the deflection angle (T_c \\propto \\theta). At equilibrium, T_d = T_c, which means the deflection angle (\\theta) is directly proportional to the current (I). This linear relationship results in a uniform scale.",
        "has_latex": true,
        "difficulty_score": 1.44
    },
    {
        "question_text": "If the ammeter resistance is not very much smaller than the load resistance, the load current can be substantially altered by the inclusion of the ammeter in the circuit.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "An ammeter is connected in series to measure current. Its own internal resistance adds to the total resistance of the circuit. If this added resistance is significant compared to the original load resistance, it will cause a noticeable decrease in the total current flowing in the circuit, leading to an inaccurate measurement. This is known as the loading effect of the ammeter.",
        "has_latex": false,
        "difficulty_score": 1.2
    },
    {
        "question_text": "To operate a moving coil instrument around a current level of say 5 A is impractical, owing to the bulk and weight of the coil that would be required.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "The moving coil in a PMMC instrument must be lightweight and delicate to be sensitive. Passing a large current like 5 A directly through it would require thick, heavy wire, making the coil bulky and destroying the instrument's sensitivity and torque-to-weight ratio. To measure such large currents, a low-resistance shunt is used to bypass the vast majority of the current around the delicate coil.",
        "has_latex": false,
        "difficulty_score": 1.2
    },
    {
        "question_text": "The use of a swamping resistance in a permanent magnet moving coil instrument, which has a temperature coefficient practically zero in series with the coil resistance, can reduce the error due to the variation of resistance of the moving coil.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "The moving coil is typically made of copper, which has a significant temperature coefficient of resistance. To minimize errors caused by temperature changes, a 'swamping resistor' made of a material like manganin (which has a near-zero temperature coefficient) is connected in series with the coil. Since the swamping resistor's value is much larger than the coil's resistance, it dominates the total circuit resistance, making the overall resistance much less sensitive to temperature variations.",
        "has_latex": false,
        "difficulty_score": 1.44
    },
    {
        "question_text": "The ammeter resistance must be very much smaller than the load resistance otherwise the load current can be substantially altered by the inclusion of the ammeter in the circuit.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "This statement accurately describes the loading effect of an ammeter. To ensure an accurate measurement, the ammeter should disturb the circuit as little as possible. By having a resistance that is negligible compared to the load resistance, the total circuit resistance remains almost unchanged, and the measured current is very close to the true current.",
        "has_latex": false,
        "difficulty_score": 1.2
    },
    {
        "question_text": "For higher range ammeters, a low resistance made up of manganin is connected in parallel to the moving coil.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "To measure high currents with a sensitive PMMC movement, a shunt resistor is connected in parallel with the coil to divert most of the current. This shunt must have a very low resistance. Manganin is the ideal material for this shunt because its resistance is stable over a wide range of temperatures, ensuring the accuracy of the current division between the shunt and the coil is not affected by temperature changes.",
        "has_latex": false,
        "difficulty_score": 1.2
    },
    {
        "question_text": "Manganin has a high temperature coefficient of resistance.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 1,
        "explanation": "Manganin is an alloy specifically used in precision electrical components like shunts and standard resistors precisely because it has a very low (practically zero) temperature coefficient of resistance. This means its resistance value remains almost constant even when its temperature changes.",
        "has_latex": false,
        "difficulty_score": 1.5
    },
    {
        "question_text": "The make-before-break switch used in a PMMC instrument is inserted so that the shunt resistance will remain open-circuited for a fraction of time during its operation.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 1,
        "explanation": "A make-before-break switch is used specifically to prevent the shunt resistance from being open-circuited. It ensures that the switch makes contact with the next terminal before breaking contact with the previous one, guaranteeing that the meter's delicate coil is never left without a parallel shunt path for the current.",
        "has_latex": false,
        "difficulty_score": 1.5
    },
    {
        "question_text": "Choose which item does not belong in the group related to noise terminology.",
        "options": [
            "Johnson Noise",
            "Internal Noise",
            "Thermal Noise",
            "White Noise"
        ],
        "correct_answer_index": 1,
        "explanation": "'Johnson Noise,' 'Thermal Noise,' and 'White Noise' are all synonymous terms describing the same specific type of noise generated by the random thermal motion of charge carriers in a conductor. 'Internal Noise' is the broader category that encompasses all noise generated within a receiver, including thermal noise, shot noise, and others.",
        "has_latex": false,
        "difficulty_score": 2.88
    },
    {
        "question_text": "Choose which item does not belong in the group related to the components of a measurement system.",
        "options": [
            "Signal Conditioner",
            "Signal Transmitter",
            "Signal Processor",
            "Signal Converter"
        ],
        "correct_answer_index": 3,
        "explanation": "In a measurement system, the 'Signal Converter' is a major element that itself comprises three sub-components: the 'Signal Conditioner,' the 'Signal Processor,' and the 'Signal Transmitter.' Therefore, the Signal Converter is the main category, while the other three are parts of it.",
        "has_latex": false,
        "difficulty_score": 2.4
    },
    {
        "question_text": "Choose which item does not belong in the group related to noise sources.",
        "options": [
            "Man-made-noise",
            "Atmospheric Noise",
            "External Noise",
            "Space Noise"
        ],
        "correct_answer_index": 2,
        "explanation": "'Man-made noise' (from ignition systems, etc.), 'Atmospheric noise' (from lightning), and 'Space noise' (from the sun and stars) are all specific types of 'External Noise.' 'External Noise' is the general classification for these types of noise that originate outside the measuring instrument.",
        "has_latex": false,
        "difficulty_score": 2.88
    },
    {
        "question_text": "Choose which item does not belong in the group related to sources of man-made noise.",
        "options": [
            "Ignition Systems",
            "Spark-producing Mechanisms",
            "Fluorescent Lights",
            "Commutators in Electric Motors"
        ],
        "correct_answer_index": 1,
        "explanation": "'Ignition Systems,' 'Fluorescent Lights,' and 'Commutators in Electric Motors' are all specific examples of man-made sources of electrical noise. 'Spark-producing Mechanisms' is a general description of the physical process that causes the noise in many of these sources, rather than being a specific source itself.",
        "has_latex": false,
        "difficulty_score": 2.4
    },
    {
        "question_text": "Choose which item does not belong in the group related to types of measurement errors.",
        "options": [
            "Random Errors",
            "Observational Errors",
            "Stochastic Errors",
            "Human Errors"
        ],
        "correct_answer_index": 0,
        "explanation": "'Observational Errors' (like parallax), 'Human Errors' (like misreading a scale), and 'Stochastic Errors' (from noise) are all specific types or causes of 'Random Errors.' 'Random Errors' is the main category that describes errors causing successive readings to vary unpredictably.",
        "has_latex": false,
        "difficulty_score": 2.88
    },
    {
        "question_text": "Choose which item does not belong in the group related to the components of a measurement system.",
        "options": [
            "Signal Conditioner",
            "Signal Transmitter",
            "Signal Processor",
            "Signal Converter"
        ],
        "correct_answer_index": 3,
        "explanation": "In a measurement system, the 'Signal Converter' is a major element that comprises the 'Signal Conditioner,' the 'Signal Processor,' and the 'Signal Transmitter.' The Signal Converter is the main category, while the other three are its constituent parts.",
        "has_latex": false,
        "difficulty_score": 2.4
    },
    {
        "question_text": "Choose which item does not belong in the group related to instrument control mechanisms.",
        "options": [
            "Balance weight",
            "Gravity control",
            "Control weight",
            "Spindle"
        ],
        "correct_answer_index": 3,
        "explanation": "'Gravity control' is a method of providing controlling torque. This method utilizes a 'Control weight' and is balanced by a 'Balance weight.' All three are components of the gravity control system. The 'Spindle' is the central axle or shaft on which the entire moving system, including the pointer and control mechanism, is mounted. It is a core structural part, not a part of the control method itself.",
        "has_latex": false,
        "difficulty_score": 2.88
    },
    {
        "question_text": "Choose which item does not belong in the group related to damping mechanisms.",
        "options": [
            "Air friction",
            "Fluid friction",
            "Damping force",
            "Eddy current"
        ],
        "correct_answer_index": 2,
        "explanation": "'Air friction,' 'Fluid friction,' and 'Eddy current' are the three primary physical methods used to provide a damping force in an instrument. 'Damping force' is the general term for the resulting force itself, not a specific method for creating it.",
        "has_latex": false,
        "difficulty_score": 2.4
    },
    {
        "question_text": "Choose which item does not belong in the group related to the elements of a measurement system.",
        "options": [
            "Sensing element",
            "Signal converter",
            "Display element",
            "Signal transmitter"
        ],
        "correct_answer_index": 3,
        "explanation": "A general measurement system consists of three main elements: the 'Sensing element,' the 'Signal converter,' and the 'Display element.' The 'Signal transmitter' is a sub-component of the signal converter.",
        "has_latex": false,
        "difficulty_score": 2.4
    },
    {
        "question_text": "Choose which item does not belong in the group related to noise sources.",
        "options": [
            "Instrument noise",
            "Man-made-noise",
            "Atmospheric noise",
            "Space noise"
        ],
        "correct_answer_index": 0,
        "explanation": "'Man-made noise,' 'Atmospheric noise,' and 'Space noise' are all types of external noise, meaning they originate outside the measuring device. 'Instrument noise' (also called internal noise) is generated by the components within the instrument itself.",
        "has_latex": false,
        "difficulty_score": 2.88
    },
    {
        "question_text": "Choose which item does not belong in the group related to systematic errors.",
        "options": [
            "Calibration Errors",
            "Construction Errors",
            "Approximation Errors",
            "Ageing Errors"
        ],
        "correct_answer_index": 0,
        "explanation": "'Construction Errors,' 'Approximation Errors,' and 'Ageing Errors' are all examples of systematic errors that can occur in an instrument. 'Calibration' is a process performed on an instrument to ensure accuracy; an error in this process is distinct from errors inherent in the instrument's construction or due to ageing.",
        "has_latex": false,
        "difficulty_score": 2.4
    },
    {
        "question_text": "Choose which item does not belong in the group related to instrument classifications.",
        "options": [
            "Panel instrument",
            "Indicating instrument",
            "Integrating instrument",
            "Recording instrument"
        ],
        "correct_answer_index": 0,
        "explanation": "Measuring instruments can be classified by their function into 'Indicating' (show instantaneous value), 'Recording' (provide a continuous record), and 'Integrating' (measure total quantity over time). 'Panel instrument' describes the physical form factor or intended use (mounted on a panel) of an instrument, not its fundamental operating function.",
        "has_latex": false,
        "difficulty_score": 2.4
    },
    {
        "question_text": "Choose which item does not belong in the group related to instrument components.",
        "options": [
            "Scale",
            "Moving Coil",
            "Spring",
            "Iron Core"
        ],
        "correct_answer_index": 0,
        "explanation": "'Moving Coil,' 'Spring' (for control), and 'Iron Core' are all internal mechanical or electromagnetic components that make up the working mechanism of a PMMC or moving-iron instrument. The 'Scale' is the external, graduated marking over which the pointer moves to provide a reading. It is part of the display system, not the internal torque-producing mechanism.",
        "has_latex": false,
        "difficulty_score": 2.4
    },
    {
        "question_text": "Choose which item does not belong in the group related to instrument components.",
        "options": [
            "Control spring",
            "Pointer",
            "Spindle",
            "Balance weight"
        ],
        "correct_answer_index": 0,
        "explanation": "The 'Pointer,' 'Spindle,' and 'Balance weight' are all parts of the core moving assembly of an instrument. The 'Control spring' is a specific component that provides the controlling torque. While it is attached to the moving assembly, its primary function defines it as part of the control system, whereas the others are fundamental parts of the indicator and rotation mechanism itself.",
        "has_latex": false,
        "difficulty_score": 2.88
    },
    {
        "question_text": "Choose which item does not belong in the group related to moving-iron instruments.",
        "options": [
            "Repulsion moving–iron instrument",
            "Attraction moving–iron instrument",
            "Moving–iron instrument Vane",
            "Single-iron moving–iron instrument"
        ],
        "correct_answer_index": 2,
        "explanation": "Moving-iron instruments are broadly classified into two types: 'Repulsion' type and 'Attraction' type. The 'Attraction' type is also known as a 'Single-iron' instrument. A 'Vane' is the small piece of soft iron that serves as the moving element in these instruments; it is a component part, not a classification of the instrument itself.",
        "has_latex": false,
        "difficulty_score": 2.4
    },
    {
        "question_text": "Choose which item does not belong in the group related to instrument operating principles.",
        "options": [
            "Electromagnetic principle",
            "Electro-thermic principle",
            "Electrostatic principle",
            "Thermal principle"
        ],
        "correct_answer_index": 3,
        "explanation": "The three main principles of operation for electrical measuring instruments are 'Electromagnetic,' 'Electrostatic,' and 'Electro-thermic.' The 'Electro-thermic principle' utilizes the heating effect of a current. 'Thermal principle' is a less specific term and often used interchangeably, but in the context of the three formal principles, it is the outlier.",
        "has_latex": false,
        "difficulty_score": 2.4
    },
    {
        "question_text": "Choose which item does not belong in the group related to DC bridge circuits.",
        "options": [
            "Wheatstone Bridge",
            "Kelvin Bridge",
            "Wien Bridge",
            "Megaohm Bridge"
        ],
        "correct_answer_index": 2,
        "explanation": "The 'Wheatstone Bridge,' 'Kelvin Bridge' (a modification of Wheatstone for low resistances), and 'Megaohm Bridge' are all types of DC bridges used for measuring resistance. The 'Wien Bridge' is an AC bridge, used for measuring capacitance or frequency.",
        "has_latex": false,
        "difficulty_score": 2.88
    },
    {
        "question_text": "Choose which item does not belong in the group related to AC bridge circuits.",
        "options": [
            "Schering Bridge",
            "Maxwell Bridge",
            "Hay Bridge",
            "Owen Bridge"
        ],
        "correct_answer_index": 0,
        "explanation": "The 'Maxwell Bridge,' 'Hay Bridge,' and 'Owen Bridge' are all AC bridges primarily used for measuring an unknown inductance. The 'Schering Bridge' is an AC bridge used for measuring an unknown capacitance and its loss angle.",
        "has_latex": false,
        "difficulty_score": 2.88
    },
    {
        "question_text": "Choose which item does not belong in the group related to bridge circuits.",
        "options": [
            "Hay Bridge",
            "Schering Bridge",
            "Kelvin Bridge",
            "Wien Bridge"
        ],
        "correct_answer_index": 2,
        "explanation": "The 'Hay Bridge,' 'Schering Bridge,' and 'Wien Bridge' are all types of AC bridges used for measuring impedance (inductance, capacitance, or frequency). The 'Kelvin Bridge' is a DC bridge, specifically designed for measuring very low values of resistance.",
        "has_latex": false,
        "difficulty_score": 2.88
    },
    {
        "question_text": "Choose which item does not belong in the group related to random errors.",
        "options": [
            "Operation Errors",
            "Human Error",
            "Environmental Errors",
            "Stochastic Errors"
        ],
        "correct_answer_index": 0,
        "explanation": "'Human Error,' 'Environmental Errors,' and 'Stochastic Errors' are all listed as causes of random errors. 'Operation Errors' is the overarching category that these specific causes fall under. Therefore, 'Operation Errors' is the general classification, while the others are specific examples within that class.",
        "has_latex": false,
        "difficulty_score": 2.4
    },
    {
        "question_text": "The reduction in the amplitude of a vibration or oscillation in a measuring instrument is known as damping.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "Damping is the process by which the oscillations of the moving system of an instrument are suppressed. A damping force is intentionally introduced to act against the movement of the system, preventing the pointer from overshooting the final reading and settling on the correct value quickly.",
        "has_latex": false,
        "difficulty_score": 1.2
    },
    {
        "question_text": "A Clamp ammeter is a convenient testing instrument that permits current measurement on a live conductor with circuit interruption.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 1,
        "explanation": "The primary advantage of a clamp ammeter is its ability to measure current on a live conductor without circuit interruption. It works by clamping its jaws around the conductor and measuring the magnetic field produced by the current flow. This allows for safe and convenient current measurement without the need to cut wires or disconnect the circuit.",
        "has_latex": false,
        "difficulty_score": 1.5
    },
    {
        "question_text": "The insulation resistance tester is usually known as meggar.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "'Meggar' is a common trade name that has become a generic term for an insulation resistance tester. These instruments are designed to measure very high resistance values, typically in the megohm range, to test the quality of insulation in electrical equipment.",
        "has_latex": false,
        "difficulty_score": 1.0
    },
    {
        "question_text": "Ammeter sensitivity is greater when the amount of current required in producing a full-scale deflection of the pointer is high.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 1,
        "explanation": "Ammeter sensitivity is inversely related to the current required for a full-scale deflection (FSD). A more sensitive instrument requires a smaller amount of current to achieve FSD. Therefore, ammeter sensitivity is greater when the FSD current is low.",
        "has_latex": false,
        "difficulty_score": 1.5
    },
    {
        "question_text": "Choose which item does not belong in the group related to the components of a voltmeter.",
        "options": [
            "Resistance",
            "Multiplier",
            "Fixed Coil",
            "Movable Coil"
        ],
        "correct_answer_index": 0,
        "explanation": "In the context of a voltmeter, a 'Multiplier' is a specific high-value resistor used to extend the voltage range. 'Fixed Coil' and 'Movable Coil' (or just 'Movable Coil' in PMMC) are fundamental parts of the meter's movement. 'Resistance' is a general electrical property, while the other three terms refer to specific, functional components of the instrument.",
        "has_latex": false,
        "difficulty_score": 2.4
    },
    {
        "question_text": "Choose which item does not belong in the group related to the components of an oscilloscope.",
        "options": [
            "Vertical Amplifier",
            "Horizontal Amplifier",
            "Oscilloscope",
            "Sweep Generator"
        ],
        "correct_answer_index": 2,
        "explanation": "The 'Vertical Amplifier,' 'Horizontal Amplifier,' and 'Sweep Generator' are all major internal blocks or sub-systems that make up an 'Oscilloscope.' The oscilloscope is the complete instrument, while the other three are essential component parts within it.",
        "has_latex": false,
        "difficulty_score": 2.4
    },
    {
        "question_text": "Choose which item does not belong in the group related to the functions within a digital meter.",
        "options": [
            "Current to Voltage Conversion",
            "Clamping",
            "Rectifying",
            "Analogue to Digital Conversion"
        ],
        "correct_answer_index": 1,
        "explanation": "'Current to Voltage Conversion' (using a shunt resistor), 'Rectifying' (to convert AC to DC), and 'Analogue to Digital Conversion' (the core of a digital meter) are all signal processing steps inside a digital multimeter. 'Clamping' is a circuit function that shifts a waveform's DC level but is not a fundamental stage in the standard measurement process of a digital meter.",
        "has_latex": false,
        "difficulty_score": 2.88
    },
    {
        "question_text": "Choose which item does not belong in the group related to instrument performance terminology.",
        "options": [
            "Accuracy",
            "Performance",
            "Stability",
            "Precision"
        ],
        "correct_answer_index": 1,
        "explanation": "'Accuracy,' 'Stability,' and 'Precision' are all specific, defined terms used to describe different aspects of an instrument's performance. 'Performance' is the general, overarching category that these specific metrics fall under, rather than being a specific metric itself.",
        "has_latex": false,
        "difficulty_score": 2.4
    },
    {
        "question_text": "Choose which item does not belong in the group related to instrument operating principles.",
        "options": [
            "Electromagnetic",
            "Electro-thermic",
            "Thermocouple",
            "Electrostatic"
        ],
        "correct_answer_index": 2,
        "explanation": "'Electromagnetic,' 'Electro-thermic,' and 'Electrostatic' are the three broad principles upon which electrical measuring instruments operate. A 'Thermocouple' is a specific type of sensor that operates on a thermoelectric effect to measure temperature; it is a device, not a general operating principle for a class of indicating instruments like the others.",
        "has_latex": false,
        "difficulty_score": 2.4
    },
    {
        "question_text": "Choose which item does not belong in the group related to instrument devices.",
        "options": [
            "Controlling device",
            "Deflecting device",
            "Damping device",
            "Calibration device"
        ],
        "correct_answer_index": 3,
        "explanation": "Every measuring instrument is composed of three essential internal parts or devices: a 'Deflecting device' to create movement, a 'Controlling device' to oppose the movement, and a 'Damping device' to bring the movement to rest quickly. 'Calibration' is a process performed on an instrument to ensure its accuracy; a 'Calibration device' would be an external standard used for this process, not an internal part of the instrument being measured.",
        "has_latex": false,
        "difficulty_score": 2.88
    },
    {
        "question_text": "To minimize voltmeter loading in multi-range voltmeters, the voltmeter operating current should be very low.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "The loading effect of a voltmeter occurs when it draws current from the circuit it is measuring, thereby altering the voltage. To minimize this effect, a voltmeter should have a very high internal resistance. According to Ohm's law (I = V/R), a high resistance results in a very low operating current, ensuring that the instrument has a minimal impact on the circuit's original conditions.",
        "has_latex": false,
        "difficulty_score": 1.2
    },
    {
        "question_text": "The sensing element of a measuring instrument takes the signal from the sensing element and amplifies it into a suitable condition for display.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 1,
        "explanation": "The sensing element (or transducer) is the part that first detects the physical quantity being measured and converts it into an initial signal. The component that takes this signal and amplifies or modifies it for display is the signal converter or signal conditioner.",
        "has_latex": false,
        "difficulty_score": 1.5
    },
    {
        "question_text": "The extent to which a wrong reading might be obtained is referred to as accuracy.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "Accuracy is a measure of how close a measurement is to the true value. It is often expressed as a plus-or-minus value (e.g., \\pm0.1 A) or a percentage of the full-scale reading, indicating the potential deviation or error from the true value.",
        "has_latex": true,
        "difficulty_score": 1.0
    },
    {
        "question_text": "A multirange ammeter can be constructed simply by employing several values of series resistances, with a rotary switch to select the desired range.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 1,
        "explanation": "A multirange ammeter is constructed using several parallel resistors, known as shunts. These shunts divert a specific portion of the current around the meter's delicate coil. Series resistors, known as multipliers, are used to construct multirange voltmeters.",
        "has_latex": false,
        "difficulty_score": 1.5
    },
    {
        "question_text": "The smallest interval measurable by a measuring instrument is known as resolution.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "Resolution defines the smallest change in the measured quantity that an instrument can detect and display. For example, if a digital voltmeter can display a value of 1.234 V but not 1.2345 V, its resolution is 0.001 V.",
        "has_latex": false,
        "difficulty_score": 1.0
    },
    {
        "question_text": "The movement of a permanent magnet moving coil instrument may be temperature-compensated by the appropriate use of series and shunt resistors of copper and manganin.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "Temperature changes can affect the resistance of an instrument's copper coil, leading to errors. By using resistors made of materials with different temperature coefficients (like copper and manganin) in series and parallel combinations, it's possible to create a circuit whose overall resistance is much less affected by temperature changes, thus compensating for the error.",
        "has_latex": false,
        "difficulty_score": 1.44
    },
    {
        "question_text": "Resistors and the resistances within all electronic devices are constantly producing a noise voltage.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "This describes thermal noise (or Johnson noise), which is a fundamental phenomenon in electronics. The random thermal motion of charge carriers (electrons) within a conductor generates a fluctuating voltage. This noise is present in all resistive components and its power is proportional to the temperature and bandwidth.",
        "has_latex": false,
        "difficulty_score": 1.2
    },
    {
        "question_text": "The sensitivity of a voltmeter is equal to the reciprocal of the full-scale deflection current.",
        "options": [
            "True",
            "False"
        ],
        "correct_answer_index": 0,
        "explanation": "Voltmeter sensitivity is expressed in ohms per volt (\\Omega/V). It is calculated as the total resistance of the voltmeter (meter resistance + multiplier resistance) divided by the full-scale voltage. This value is also the reciprocal of the current required for full-scale deflection (Sensitivity = 1 / I_{fsd}).",
        "has_latex": true,
        "difficulty_score": 1.44
    },
    {
        "question_text": "For spiral springs and strip suspensions in a measuring instrument, the controlling torque is directly proportional to the...",
        "options": [
            "current in the coil.",
            "deflection angle of the coil.",
            "magnetic field strength.",
            "voltage across the coil."
        ],
        "correct_answer_index": 1,
        "explanation": "The controlling torque is provided by the mechanical suspension, typically spiral springs. Based on the principle of elasticity, the restoring torque exerted by the spring is directly proportional to the angle through which it is twisted. This angle is the deflection angle (\\theta) of the instrument's pointer.",
        "has_latex": true,
        "difficulty_score": 1.44
    },
    {
        "question_text": "When current is passed through the coil windings of a PMMC instrument, torque is developed on the coil by the ______ of the permanent magnetic field and the field set up by the current.",
        "options": [
            "repulsion",
            "addition",
            "interaction",
            "cancellation"
        ],
        "correct_answer_index": 2,
        "explanation": "The operating principle of a PMMC instrument is based on the motor effect. A deflecting torque is produced due to the force experienced by a current-carrying conductor in a magnetic field. This force arises from the interaction between the magnetic field of the permanent magnet and the magnetic field produced by the current flowing through the coil.",
        "has_latex": false,
        "difficulty_score": 1.44
    },
    {
        "question_text": "To use a permanent magnet moving coil (PMMC) device as a meter, one of the problems that must be solved is returning the coil to its zero position. This is solved by the use of ______ attached to each end of the coil.",
        "options": [
            "damping vanes",
            "counterweights",
            "jeweled bearings",
            "spiral springs"
        ],
        "correct_answer_index": 3,
        "explanation": "Spiral springs (or hairsprings) serve two crucial functions in a PMMC instrument. First, they provide the controlling torque that opposes the deflecting torque and is proportional to the angle of deflection. Second, they provide the restoring force that returns the pointer and coil to the zero position when the current is removed.",
        "has_latex": false,
        "difficulty_score": 1.44
    },
    {
        "question_text": "To increase the accuracy and efficiency of a PMMC meter movement, an iron core is placed inside the coil to...",
        "options": [
            "reduce the weight of the coil.",
            "provide eddy-current damping.",
            "concentrate the magnetic fields.",
            "act as a pivot for the coil."
        ],
        "correct_answer_index": 2,
        "explanation": "A soft iron core is placed inside the moving coil to concentrate the magnetic flux lines from the permanent magnet, passing them through the coil. This creates a stronger and more uniform radial magnetic field in the air gap where the coil rotates, resulting in a larger deflecting torque for a given current and improving the instrument's sensitivity and accuracy.",
        "has_latex": false,
        "difficulty_score": 1.44
    },
    {
        "question_text": "In a PMMC instrument, the pole faces of the permanent magnet are curved to ensure the turning force on the coil...",
        "options": [
            "remains constant as current increases.",
            "is proportional to the deflection angle.",
            "increases as the current increases.",
            "is independent of the current."
        ],
        "correct_answer_index": 2,
        "explanation": "The curved pole faces, along with the soft iron core, create a uniform radial magnetic field in the air gap. This ensures that the force on the coil sides is always at a maximum for any coil position within its range of movement. This design feature helps to make the deflecting torque directly proportional to the coil current, which in turn leads to a linear (uniformly divided) scale. The statement 'ensure the turning force on the coil increases as the current increases' is a direct consequence of this proportionality (Force \\propto Current).",
        "has_latex": true,
        "difficulty_score": 1.44
    },
    {
        "question_text": "An ammeter with a 0-15 A range has a stated accuracy of \\pm2% of full-scale deflection (fsd). If the meter reads 10 A, what is the maximum possible error in the reading in amperes?",
        "options": [
            "\\pm0.2 A",
            "\\pm0.3 A",
            "\\pm0.1 A",
            "\\pm0.5 A"
        ],
        "correct_answer_index": 1,
        "explanation": "The error is a percentage of the full-scale value, not the reading. Calculate Error = 2% of 15 A = 0.02 × 15 A = 0.3 A.",
        "has_latex": true,
        "difficulty_score": 1.8
    },
    {
        "question_text": "A PMMC instrument has a coil resistance of 100 \\Omega and gives a full-scale deflection (FSD) for a current of 500 \\muA. What value of shunt resistance is required to use the instrument as an ammeter with a range of 10 A?",
        "options": [
            "0.100 \\Omega",
            "0.0050 \\Omega",
            "0.0500 \\Omega",
            "0.0100 \\Omega"
        ],
        "correct_answer_index": 1,
        "explanation": "The voltage across the meter (V_m) must equal the voltage across the shunt (V_{sh}). Use the formula I_m \\times R_m = (I - I_m) \\times R_{sh}. Solving for R_{sh} gives (500\\muA \\times 100\\Omega) / (10A - 500\\muA) \\approx 0.0050 \\Omega.",
        "has_latex": true,
        "difficulty_score": 2.34
    },
    {
        "question_text": "Using the same PMMC instrument from the previous question (R_m = 100 \\Omega, FSD = 500 \\muA), what value of series multiplier resistance is needed to convert it into a voltmeter with a range of 0-50 V?",
        "options": [
            "99.9 k\\Omega",
            "100 k\\Omega",
            "50 k\\Omega",
            "49.9 k\\Omega"
        ],
        "correct_answer_index": 0,
        "explanation": "The multiplier resistance R_s = (V / I_m) - R_m. Calculate R_s = (50 V / 500 \\muA) - 100 \\Omega = 100,000 \\Omega - 100 \\Omega = 99,900 \\Omega or 99.9 k\\Omega.",
        "has_latex": true,
        "difficulty_score": 1.95
    },
    {
        "question_text": "A voltmeter has a sensitivity of 20,000 \\Omega/V. What is the full-scale deflection current (I_{fsd}) of the meter movement?",
        "options": [
            "50 \\muA",
            "20 mA",
            "100 \\muA",
            "50 mA"
        ],
        "correct_answer_index": 0,
        "explanation": "Sensitivity is the reciprocal of the full-scale deflection current (I_{fsd}). Calculate I_{fsd} = 1 / Sensitivity = 1 / 20,000 \\Omega/V = 50 \\muA.",
        "has_latex": true,
        "difficulty_score": 1.8
    },
    {
        "question_text": "An oscilloscope displays a sine wave that covers 6 vertical divisions from peak to peak. If the vertical sensitivity is set to 2 V/div, what is the peak-to-peak voltage (V_{p-p}) of the waveform?",
        "options": [
            "6 V",
            "3 V",
            "12 V",
            "24 V"
        ],
        "correct_answer_index": 2,
        "explanation": "Calculate V_{p-p} = (vertical divisions) \\times (Volts/div). This gives 6 div \\times 2 V/div = 12 V.",
        "has_latex": true,
        "difficulty_score": 2.25
    },
    {
        "question_text": "On the same oscilloscope screen, one complete cycle of a waveform covers 8 horizontal divisions. If the time/division setting is 5 ms/div, what is the frequency of the signal?",
        "options": [
            "25 Hz",
            "40 Hz",
            "20 Hz",
            "50 Hz"
        ],
        "correct_answer_index": 0,
        "explanation": "First, find the period T = (horizontal divisions) \\times (Time/div) = 8 \\times 5 ms = 40 ms. Then, calculate frequency f = 1 / T = 1 / 0.040 s = 25 Hz.",
        "has_latex": false,
        "difficulty_score": 2.925
    },
    {
        "question_text": "In a balanced Wheatstone bridge, R1 = 1.5 k\\Omega, R2 = 4.5 k\\Omega, and R3 = 2.0 k\\Omega. What is the value of the unknown resistance R_x (R4)?",
        "options": [
            "6.0 k\\Omega",
            "3.0 k\\Omega",
            "1.0 k\\Omega",
            "0.67 k\\Omega"
        ],
        "correct_answer_index": 0,
        "explanation": "For a balanced bridge, R_x = R_3 \\times (R_2 / R_1). Plugging in the values gives R_x = 2.0 k\\Omega \\times (4.5 k\\Omega / 1.5 k\\Omega) = 6.0 k\\Omega.",
        "has_latex": true,
        "difficulty_score": 1.8
    },
    {
        "question_text": "A resistor generates thermal noise. If its temperature is 27°C and the system bandwidth is 10 kHz, what is the noise power generated? (Boltzmann's constant, k = 1.38 x 10^{-23} J/K)",
        "options": [
            "4.14 x 10^{-17} W",
            "3.73 x 10^{-18} W",
            "4.14 x 10^{-20} W",
            "1.38 x 10^{-19} W"
        ],
        "correct_answer_index": 0,
        "explanation": "Use the formula P_n = k * T * \\Delta f, where T is in Kelvin (27°C = 300 K). P_n = (1.38e-23) \\times 300 \\times 10,000 = 4.14 x 10^{-17} W.",
        "has_latex": true,
        "difficulty_score": 1.95
    },
    {
        "question_text": "An oscilloscope displays a waveform with a peak voltage of 5 V. If the vertical setting is 1 V/div, how many divisions does the waveform cover from the center line to its peak?",
        "options": [
            "1 division",
            "2.5 divisions",
            "5 divisions",
            "10 divisions"
        ],
        "correct_answer_index": 2,
        "explanation": "Calculate Divisions = Voltage / (Volts/div). This gives 5 V / 1 V/div = 5 divisions.",
        "has_latex": false,
        "difficulty_score": 2.25
    },
    {
        "question_text": "A PMMC instrument with a coil resistance of 50 \\Omega and an FSD of 1 mA is to be used as a voltmeter with a 0-100 V range. What is its sensitivity in \\Omega/V?",
        "options": [
            "100 \\Omega/V",
            "50 \\Omega/V",
            "1000 \\Omega/V",
            "500 \\Omega/V"
        ],
        "correct_answer_index": 2,
        "explanation": "Sensitivity is the reciprocal of the full-scale deflection current. Calculate Sensitivity = 1 / I_{fsd} = 1 / 0.001 A = 1000 \\Omega/V.",
        "has_latex": true,
        "difficulty_score": 1.8
    },
    {
        "question_text": "In a Hay Bridge balanced at 1 kHz, R_1 = 1 k\\Omega, R_2 = 5 k\\Omega, R_3 = 2 k\\Omega, and C_1 = 0.1 \\muF. Assuming a high Q coil, calculate the unknown inductance, L_x.",
        "options": [
            "1 H",
            "10 H",
            "1 mH",
            "10 mH"
        ],
        "correct_answer_index": 0,
        "explanation": "For a high Q coil, the Hay Bridge formula simplifies to L_x \\approx R_2 \\times R_3 \\times C_1. This gives 5000 \\Omega \\times 2000 \\Omega \\times 0.1 \\muF = 1 H.",
        "has_latex": true,
        "difficulty_score": 1.8
    },
    {
        "question_text": "For the Hay Bridge in the previous question (f=1kHz, R_1=1k\\Omega, R_2=5k\\Omega, R_3=2k\\Omega, C_1=0.1\\muF), calculate the unknown series resistance, R_x.",
        "options": [
            "1.42 k\\Omega",
            "3.95 k\\Omega",
            "2.83 k\\Omega",
            "7.17 k\\Omega"
        ],
        "correct_answer_index": 2,
        "explanation": "Use the formula R_x = (\\omega^2 C_1^2 R_1 R_2 R_3) / (1 + (\\omega C_1 R_1)^2), where \\omega = 2\\pi f = 6283 rad/s. This gives (39.48 \\times 10^{10} \\times 10^{-14}) / (1 + 0.3948) \\approx 2830 \\Omega or 2.83 k\\Omega.",
        "has_latex": true,
        "difficulty_score": 2.34
    },
    {
        "question_text": "An oscilloscope shows one cycle spanning 10 horizontal divisions. A second wave starts 1.5 divisions after the first. What is the phase difference in degrees?",
        "options": [
            "15°",
            "36°",
            "54°",
            "1.5°"
        ],
        "correct_answer_index": 2,
        "explanation": "First, find degrees per division: 360° / 10 div = 36°/div. Then, calculate Phase Difference = 1.5 div \\times 36°/div = 54°.",
        "has_latex": false,
        "difficulty_score": 2.925
    },
    {
        "question_text": "Using a Lissajous pattern to measure phase shift, the vertical intercept (Y_1) is 2.5 cm and the maximum vertical deflection (Y_2) is 5.0 cm. What is the phase angle?",
        "options": [
            "60°",
            "30°",
            "45°",
            "90°"
        ],
        "correct_answer_index": 1,
        "explanation": "Use the formula sin(\\theta) = Y_1 / Y_2. So, sin(\\theta) = 2.5 / 5.0 = 0.5. The phase angle \\theta = arcsin(0.5) = 30°.",
        "has_latex": true,
        "difficulty_score": 2.25
    },
    {
        "question_text": "A PMMC instrument with a 150 \\Omega coil and 100 \\muA FSD is used for a 150 V range voltmeter. What is the total resistance?",
        "options": [
            "1.5 M\\Omega",
            "150 k\\Omega",
            "1.499 M\\Omega",
            "15 k\\Omega"
        ],
        "correct_answer_index": 0,
        "explanation": "The total resistance of the voltmeter is R_{total} = V_{fsd} / I_{fsd}. This gives 150 V / 100 \\muA = 1,500,000 \\Omega or 1.5 M\\Omega.",
        "has_latex": true,
        "difficulty_score": 1.8
    },
    {
        "question_text": "A diode has a shot noise current of 2 nA over a 1 MHz bandwidth. What is the DC current (I_{dc})? (q = 1.6 x 10^{-19} C)",
        "options": [
            "12.5 \\muA",
            "25.0 \\muA",
            "6.25 \\muA",
            "50.0 \\muA"
        ],
        "correct_answer_index": 0,
        "explanation": "From the formula i_n^2 = 2q * I_{dc} * \\Delta f, rearrange to find I_{dc} = i_n^2 / (2q * \\Delta f). This gives (2 nA)^2 / (2 \\times 1.6e-19 \\times 1e6) = 12.5 \\muA.",
        "has_latex": true,
        "difficulty_score": 2.34
    },
    {
        "question_text": "In an unbalanced Wheatstone bridge, R_1=100\\Omega, R_2=1k\\Omega, R_3=200\\Omega, R_4=2005\\Omega, and V_{supply}=5V. Calculate the Thévenin voltage (V_{th}).",
        "options": [
            "5.54 mV",
            "3.32 mV",
            "2.77 mV",
            "8.31 mV"
        ],
        "correct_answer_index": 2,
        "explanation": "V_{th} is the voltage difference between the two arms. V_{th} = V \\times [ R_1/(R_1+R_3) - R_2/(R_2+R_4) ]. This gives 5 \\times [100/300 - 1000/3005] \\approx 2.77 mV.",
        "has_latex": true,
        "difficulty_score": 1.95
    },
    {
        "question_text": "For the same unbalanced bridge (R_1=100\\Omega, R_2=1k\\Omega, R_3=200\\Omega, R_4=2005\\Omega), calculate the Thévenin resistance (R_{th}).",
        "options": [
            "734 \\Omega",
            "668 \\Omega",
            "801 \\Omega",
            "753 \\Omega"
        ],
        "correct_answer_index": 0,
        "explanation": "R_{th} is the parallel combination of the arm resistors. R_{th} = (R_1 || R_3) + (R_2 || R_4) = (100*200/300) + (1000*2005/3005) = 66.7 + 667.2 \\approx 734 \\Omega.",
        "has_latex": true,
        "difficulty_score": 1.95
    },
    {
        "question_text": "An oscilloscope shows one cycle of a 500 Hz sine wave. How many horizontal divisions will the cycle occupy if the timebase is set to 0.2 ms/div?",
        "options": [
            "5 divisions",
            "2 divisions",
            "10 divisions",
            "4 divisions"
        ],
        "correct_answer_index": 2,
        "explanation": "First, find the period T = 1 / f = 1/500 Hz = 2 ms. Then, calculate Divisions = T / (Time/div) = 2 ms / 0.2 ms/div = 10 divisions.",
        "has_latex": false,
        "difficulty_score": 2.925
    },
    {
        "question_text": "In a two-wattmeter method, the readings are W_1 = 3000 W and W_2 = 1500 W. What is the total power?",
        "options": [
            "1500 W",
            "3000 W",
            "4500 W",
            "2250 W"
        ],
        "correct_answer_index": 2,
        "explanation": "The total power in the two-wattmeter method is the algebraic sum of the two readings. P_{total} = W_1 + W_2 = 3000 W + 1500 W = 4500 W.",
        "has_latex": true,
        "difficulty_score": 1.5
    },
    {
        "question_text": "In a two-wattmeter test, the readings are W_1=2815 W and W_2=1685 W. Calculate the power factor.",
        "options": [
            "0.866",
            "0.917",
            "0.500",
            "0.707"
        ],
        "correct_answer_index": 1,
        "explanation": "First find the phase angle using tan(\\Phi) = \\sqrt{3} * |W_1-W_2| / (W_1+W_2) = \\sqrt{3} * 1130 / 4500 \\approx 0.435. Then, \\Phi = arctan(0.435) \\approx 23.5°. The power factor is cos(\\Phi) = cos(23.5°) \\approx 0.917.",
        "has_latex": true,
        "difficulty_score": 2.34
    },
    {
        "question_text": "An AC bridge is balanced. The impedances are Z_1 = 100\\angle80° \\Omega, Z_2 = 250\\angle0° \\Omega, and Z_3 = 400\\angle30° \\Omega. What is the magnitude of the unknown impedance Z_4?",
        "options": [
            "1000 \\Omega",
            "100 \\Omega",
            "625 \\Omega",
            "160 \\Omega"
        ],
        "correct_answer_index": 0,
        "explanation": "At balance, |Z_4| = (|Z_2| \\times |Z_3|) / |Z_1|. Plugging in the values gives (250 \\times 400) / 100 = 1000 \\Omega.",
        "has_latex": true,
        "difficulty_score": 1.8
    },
    {
        "question_text": "For the same AC bridge (Z_1 = 100\\angle80°, Z_2 = 250\\angle0°, Z_3 = 400\\angle30°), what is the phase angle of Z_4?",
        "options": [
            "110°",
            "50°",
            "-50°",
            "-30°"
        ],
        "correct_answer_index": 2,
        "explanation": "At balance, the sum of phase angles of opposite arms are equal. \\angle Z_4 = \\angle Z_2 + \\angle Z_3 - \\angle Z_1 = 0° + 30° - 80° = -50°.",
        "has_latex": true,
        "difficulty_score": 1.95
    },
    {
        "question_text": "A moving iron instrument has dL/d\\theta = 150 \\muH/rad and a spring constant C = 3 x 10^{-6} Nm/rad. What current causes a 1 radian deflection?",
        "options": [
            "100 mA",
            "200 mA",
            "141 mA",
            "250 mA"
        ],
        "correct_answer_index": 1,
        "explanation": "At balance, T_d = T_c, so (1/2)I^2(dL/d\\theta) = C\\theta. Solving for I gives \\sqrt{2C\\theta / (dL/d\\theta)} = \\sqrt{2 \\times 3e-6 \\times 1 / 150e-6} = \\sqrt{0.04} = 0.2 A or 200 mA.",
        "has_latex": true,
        "difficulty_score": 2.34
    },
    {
        "question_text": "A thermocouple has a sensitivity (\\alpha) of 40 \\muV/°C. If the cold junction is at 0°C and the meter reads 2.0 mV, what is the hot junction temperature?",
        "options": [
            "20°C",
            "50°C",
            "80°C",
            "40°C"
        ],
        "correct_answer_index": 1,
        "explanation": "From the relation e = \\alpha(\\theta_1 - \\theta_2), solve for \\theta_1 = e/\\alpha + \\theta_2. This gives (2.0 mV / 40 \\muV/°C) + 0°C = 50°C.",
        "has_latex": true,
        "difficulty_score": 1.8
    },
    {
        "question_text": "A clamp ammeter has a 1000:1 turns ratio (N=1000). If the meter reads a secondary current of 5 mA, what is the primary conductor current?",
        "options": [
            "50 A",
            "0.5 A",
            "5 A",
            "500 A"
        ],
        "correct_answer_index": 2,
        "explanation": "The primary current is the secondary current multiplied by the turns ratio. I_{primary} = i_{secondary} \\times N = 5 mA \\times 1000 = 5 A.",
        "has_latex": false,
        "difficulty_score": 1.8
    },
    {
        "question_text": "A PMMC meter has a coil resistance of 200 \\Omega and an FSD current of 100 \\muA. What is the voltage drop across the meter at full scale?",
        "options": [
            "20 mV",
            "2 V",
            "200 mV",
            "2 mV"
        ],
        "correct_answer_index": 0,
        "explanation": "Using Ohm's Law, V_m = I_m \\times R_m. This gives 100 \\muA \\times 200 \\Omega = 0.02 V or 20 mV.",
        "has_latex": true,
        "difficulty_score": 1.8
    },
    {
        "question_text": "A Wien Bridge oscillator is balanced when R_3=10 k\\Omega, C_1=10 nF, R_4=R_3, and C_2=C_1. What is the frequency?",
        "options": [
            "1.59 kHz",
            "15.9 Hz",
            "159 Hz",
            "15.9 kHz"
        ],
        "correct_answer_index": 0,
        "explanation": "The simplified frequency formula is f = 1 / (2\\pi RC). Plugging in the values gives 1 / (2\\pi \\times 10k\\Omega \\times 10nF) \\approx 1591.5 Hz or 1.59 kHz.",
        "has_latex": true,
        "difficulty_score": 1.8
    },
    {
        "question_text": "A multirange ammeter is on its 5 A range. The meter has R_m=50\\Omega and I_m=1mA. Calculate the shunt resistance.",
        "options": [
            "0.0100 \\Omega",
            "0.0250 \\Omega",
            "0.0500 \\Omega",
            "0.1000 \\Omega"
        ],
        "correct_answer_index": 0,
        "explanation": "Using the shunt formula R_{sh} = (I_m \\times R_m) / (I - I_m), this gives (1mA \\times 50\\Omega) / (5A - 1mA) \\approx 0.0100 \\Omega.",
        "has_latex": true,
        "difficulty_score": 2.34
    },
    {
        "question_text": "An oscilloscope displays a pulse covering 4.6 horizontal divisions. If the time/div setting is 20 \\mus/div, what is the pulse width?",
        "options": [
            "46 \\mus",
            "9.2 \\mus",
            "92 \\mus",
            "23 \\mus"
        ],
        "correct_answer_index": 2,
        "explanation": "Calculate Pulse Width = (horizontal divisions) \\times (Time/div). This gives 4.6 div \\times 20 \\mus/div = 92 \\mus.",
        "has_latex": true,
        "difficulty_score": 2.25
    },
    {
        "question_text": "A voltmeter with a sensitivity of 10 k\\Omega/V is on its 50 V range. What is its total resistance?",
        "options": [
            "100 k\\Omega",
            "500 k\\Omega",
            "50 k\\Omega",
            "1 M\\Omega"
        ],
        "correct_answer_index": 1,
        "explanation": "Total Resistance = Sensitivity \\times Range = 10,000 \\Omega/V \\times 50 V = 500,000 \\Omega or 500 k\\Omega.",
        "has_latex": true,
        "difficulty_score": 1.8
    },
    {
        "question_text": "A 100-turn PMMC coil (2cm x 1cm) is in a 0.1 T field. With a 1 mA current, what is the deflecting torque?",
        "options": [
            "2.0 \\muNm",
            "20 \\muNm",
            "0.2 \\muNm",
            "200 \\muNm"
        ],
        "correct_answer_index": 0,
        "explanation": "Use the formula T = N * B * A * I, where Area A = 0.02m \\times 0.01m = 0.0002 m^2. This gives 100 \\times 0.1 \\times 0.0002 \\times 0.001 = 2 \\muNm.",
        "has_latex": true,
        "difficulty_score": 1.95
    },
    {
        "question_text": "In a two-wattmeter measurement, one meter reads 5 kW and the other reads -2 kW. What is the total power?",
        "options": [
            "7 kW",
            "3 kW",
            "3.5 kW",
            "-2 kW"
        ],
        "correct_answer_index": 1,
        "explanation": "Total power is the algebraic sum of the readings. P_{total} = W_1 + W_2 = 5 kW + (-2 kW) = 3 kW.",
        "has_latex": false,
        "difficulty_score": 1.5
    },
    {
        "question_text": "In a two-wattmeter test, the readings are W_1=4 kW and W_2=-1 kW. Calculate the power factor.",
        "options": [
            "0.500",
            "0.866",
            "0.327",
            "0.281"
        ],
        "correct_answer_index": 2,
        "explanation": "First find the phase angle using tan(\\Phi) = \\sqrt{3} * |W_1-W_2| / (W_1+W_2) = \\sqrt{3} * 5kW / 3kW \\approx 2.887. Then, \\Phi = arctan(2.887) \\approx 70.9°. The power factor is cos(70.9°) \\approx 0.327.",
        "has_latex": true,
        "difficulty_score": 2.34
    },
    {
        "question_text": "An oscilloscope displays a sine wave with V_{p-p} of 18 V. If the scale is 5 V/div, how many divisions does it span?",
        "options": [
            "1.8 div",
            "9.0 div",
            "3.6 div",
            "0.9 div"
        ],
        "correct_answer_index": 2,
        "explanation": "Calculate Divisions = Total Voltage / (Volts/div) = 18 V / 5 V/div = 3.6 divisions.",
        "has_latex": true,
        "difficulty_score": 2.25
    },
    {
        "question_text": "A Wheatstone bridge uses R_1=500\\Omega (\\pm0.1%), R_2=500\\Omega (\\pm0.1%), and R_3=520.4\\Omega (\\pm0.2%). What is the percentage uncertainty in R_x?",
        "options": [
            "\\pm0.2%",
            "\\pm0.3%",
            "\\pm0.4%",
            "\\pm0.1%"
        ],
        "correct_answer_index": 2,
        "explanation": "For R_x = R_3 * (R_2 / R_1), the percentage uncertainties add. Total %Uncertainty = %err(R_1) + %err(R_2) + %err(R_3) = 0.1% + 0.1% + 0.2% = \\pm0.4%.",
        "has_latex": true,
        "difficulty_score": 1.44
    },
    {
        "question_text": "A PMMC meter with R_m=300\\Omega and I_m=150\\muA is converted to a 75V voltmeter. Calculate the multiplier resistance R_s.",
        "options": [
            "500 k\\Omega",
            "499.7 k\\Omega",
            "75 k\\Omega",
            "74.7 k\\Omega"
        ],
        "correct_answer_index": 1,
        "explanation": "The required multiplier resistance is R_s = (V / I_m) - R_m. This gives (75V / 150\\muA) - 300\\Omega = 500,000\\Omega - 300\\Omega = 499.7 k\\Omega.",
        "has_latex": true,
        "difficulty_score": 1.95
    },
    {
        "question_text": "A 250 k\\Omega voltmeter measures the voltage across a 50 k\\Omega resistor. What is the percentage loading error?",
        "options": [
            "-16.7%",
            "-20.0%",
            "-10.5%",
            "-5.0%"
        ],
        "correct_answer_index": 0,
        "explanation": "The measured resistance is R_{measured} = R_{volt} || R_{resistor} = 41.67 k\\Omega. The error is ((R_{measured} - R_{true}) / R_{true}) * 100% = ((41.67-50)/50)*100% = -16.7%.",
        "has_latex": true,
        "difficulty_score": 2.34
    },
    {
        "question_text": "The coil of a moving iron ammeter has a time constant (L_m/R_m) of 2 ms. For frequency-independent operation, what should the shunt's time constant be?",
        "options": [
            "2 ms",
            "1 ms",
            "4 ms",
            "It doesn't matter"
        ],
        "correct_answer_index": 0,
        "explanation": "To ensure the current division is independent of frequency, the time constants of the parallel coil and shunt branches must be equal. Therefore, L_{sh}/R_{sh} = L_m/R_m = 2 ms.",
        "has_latex": true,
        "difficulty_score": 1.44
    },
    {
        "question_text": "A galvanometer has a sensitivity of 10 mm/\\muA. If 3.32 \\muA flows through it, what is the deflection?",
        "options": [
            "3.32 mm",
            "33.2 mm",
            "0.332 mm",
            "332 mm"
        ],
        "correct_answer_index": 1,
        "explanation": "Calculate Deflection = Current \\times Sensitivity = 3.32 \\muA \\times 10 mm/\\muA = 33.2 mm.",
        "has_latex": true,
        "difficulty_score": 1.5
    },
    {
        "question_text": "Calculate the power factor for a load when two wattmeter readings are equal.",
        "options": [
            "0",
            "0.5",
            "0.866",
            "1.0"
        ],
        "correct_answer_index": 3,
        "explanation": "If W_1 = W_2, the phase angle formula tan(\\Phi) = \\sqrt{3} * (W_1-W_2) / (W_1+W_2) becomes 0. The angle is arctan(0) = 0°, so the power factor, cos(0°), is 1.0.",
        "has_latex": true,
        "difficulty_score": 1.8
    }
]